DataProcessors/упПланированиеПериодическихРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упПланированиеПериодическихРейсов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/упГрафикиПериодическихРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упГрафикиПериодическихРейсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРасписанияПериодическихРейсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/упПланированиеПериодическихРейсов/Forms/ШаблонЗаполненияПериодов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	мсвРасписаний = Параметры.МассивРасписаний;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упРасписанияПериодическихРейсов.Ссылка КАК Расписание,
	|	ВЫБОР
	|		КОГДА упРасписанияПериодическихРейсов.ТранспортноеСредство = ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	Справочник.упРасписанияПериодическихРейсов КАК упРасписанияПериодическихРейсов
	|ГДЕ
	|	упРасписанияПериодическихРейсов.Ссылка В(&МассивРасписаний)";
	Запрос.УстановитьПараметр("МассивРасписаний", мсвРасписаний);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Шаблон.Добавить(), Выборка);
	КонецЦикла; 
	
	ВыборНедель = 0;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы
// Нет.

#КонецОбласти 


#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
			ТекстПредупреждения = НСтр("ru = 'Дата начала не может быть больше даты окончания'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			Возврат;
		КонецЕсли; 
		
		СоздатьПериодыНаСервере();
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	упСервисныеФункцииКлиент.РедактироватьПериод(Объект, Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания"));
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьПериодыНаСервере()
	
	тзДниНедели = Новый ТаблицаЗначений;
	тзДниНедели.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	тзДниНедели.Колонки.Добавить("ДеньНедели", Новый ОписаниеТипов("Число"));
	тзДниНедели.Колонки.Добавить("ЧетнаяНеделя", Новый ОписаниеТипов("Булево"));
	тзДниНедели.Колонки.Добавить("НеЧетнаяНеделя", Новый ОписаниеТипов("Булево"));
	тзДниНедели.Колонки.Добавить("НеделяГода", Новый ОписаниеТипов("Число"));
	
	текДата = Объект.ДатаНачала;
	
	СмещениеНедель = 0;
	НачалоГода = НачалоГода(текДата);
	ДеньНедели = ДеньНедели(НачалоГода);
	Если НЕ ДеньНедели = 1 Тогда
		СмещениеНедель = 1;
	КонецЕсли;
	
	Пока текДата <= Объект.ДатаОкончания Цикл
		НоваяСтрока = тзДниНедели.Добавить();
		НоваяСтрока.Период = текДата;
		НоваяСтрока.ДеньНедели = ДеньНедели(текДата);
		НеделяГода = НеделяГода(текДата) - СмещениеНедель;
		НоваяСтрока.НеделяГода = НеделяГода;
		НоваяСтрока.НеЧетнаяНеделя = НеделяГода % 2;
		НоваяСтрока.ЧетнаяНеделя = НЕ НоваяСтрока.НеЧетнаяНеделя;
		
		
		текДата = текДата + 86400;
	КонецЦикла;
	
	Для каждого текСтрока Из Шаблон Цикл
		
		Если текСтрока.Понедельник Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 1));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
						
					Если текСтрока.ПонедельникКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе	
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
							ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.ПонедельникКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		Если текСтрока.Вторник Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 2));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
					Если текСтрока.ВторникКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе	
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
						ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.ВторникКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		Если текСтрока.Среда Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 3));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
					Если текСтрока.СредаКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
						ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.СредаКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		Если текСтрока.Четверг Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 4));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
					Если текСтрока.ЧетвергКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
						ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.ЧетвергКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		Если текСтрока.Пятница Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 5));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
					Если текСтрока.ПятницаКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
						ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.ПятницаКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		Если текСтрока.Суббота Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 6));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
					Если текСтрока.СубботаКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
						ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.СубботаКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		Если текСтрока.Воскресенье Тогда
			ИскомыеДаты = тзДниНедели.НайтиСтроки(Новый Структура("ДеньНедели", 7));
			Если ИскомыеДаты.Количество() Тогда
				Для каждого текДата Из ИскомыеДаты Цикл
					Если текСтрока.ВоскресеньеКоличествоТС = 0 Тогда
						УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
					Иначе
						Если (ВыборНедель = 0) 
							ИЛИ(ВыборНедель = 1 И текДата.НеЧетнаяНеделя) 
							ИЛИ (ВыборНедель = 2 И текДата.ЧетнаяНеделя) Тогда
						ИзменитьЗаписьРегистра(текСтрока.Расписание, текДата.Период, текСтрока.ВоскресеньеКоличествоТС);
						Иначе
							УдалитьЗаписьРегистра(текСтрока.Расписание, текДата.Период);
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗаписьРегистра(Расписание, Дата, КоличествоТС)
	
	НаборЗаписей = РегистрыСведений.упГрафикиПериодическихРейсов.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.Отбор.Расписание.Установить(Расписание); 
	НаборЗаписей.Отбор.ДатаНачалаРейса.Установить(Дата); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Расписание       = Расписание; 
	НоваяЗапись.ДатаНачалаРейса  = Дата; 
	НоваяЗапись.КоличествоТС     = КоличествоТС; 
	НоваяЗапись.Автор            = Пользователи.ТекущийПользователь();
	НоваяЗапись.ВремяНачалаРейса = ВремяНачалаРейса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры	

&НаСервере
Процедура УдалитьЗаписьРегистра(Расписание, Дата)
	
	НаборЗаписей = РегистрыСведений.упГрафикиПериодическихРейсов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Расписание.Установить(Расписание); 
	НаборЗаписей.Отбор.ДатаНачалаРейса.Установить(Дата); 
	НаборЗаписей.Записать();    
	
КонецПроцедуры

#КонецОбласти
